<template>
  <div class="branch">
    <div class="title">
      <img src="../../assets/left_nav01.jpg" alt="">
      <h1>机构设置</h1>
    </div>
    <div class="content">
      <ul class="option">
        <li v-for="(branch,index) of branchs" @click="option=index" :class="{active:index===option}">{{branch[0]}}</li>
      </ul>
      <div class="text">
        <h1>{{branchs[option][0]}}</h1>
        <p>部门简介：</p>
        <p>{{branchs[option][1]}}</p>
        <p>主要职能：</p>
        <ol>
          <li v-for="(list,index) of branchs[option][2]">{{(index+1)+'.'+list}}</li>
        </ol>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'branch',
  data(){
    return {
      option:0,
      branchs:[
      ["秘书处","秘书处是2013年校团委内部新增部门，由校团委内部三位秘书长担任职务，负责校团委内部队伍和作风建设；响应上级要求，协助作事；协调机构与各院系间的伙伴合作关系。以求真务实、积极严谨的工作作风协调运转好老师与学生干部和学生干部与学生干部之间的关系纽带，以勇于创新、积极向上的思想意识引领学院校园风气建设，以认真负责、诚挚对待的工作态度推动学生机构和院系机构的建设发展。",["负责协助校团委老师协调各项工作；","负责联系各院系团总支副书记（学生）开展工作；","负责校团委学生干部队伍建设和作风建设；","负责统筹团委各部门开展工作；","完成领导交办的其他任务。"]],
      ["办公室","校团委办公室是在校团委直接领导下开展工作的学生组织，是以服务、监督、协调为一体的综合型部门，负责大型活动的督查督办，在做好各类会务工作的同时，负责团属场地、资产、器材、校学生礼仪队等的管理与借用，致力于完善团内档案资料的整理存放及团委年鉴制作，力求成为校团委与各学生机构、各院系之间真正的桥梁和纽带。",["负责协助秘书处协调团委内设部门及做好来访接待工作；","负责会议、文件的管理和团委印章、财务的管理；","负责团属场地、资产、器材等的管理与借用；","负责团属场地、资产、器材等的管理与借用；","负责团委各项工作的跟踪督查督办；","负责校学生礼仪队的管理；","完成领导交办的其他任务。"]],
      ["组织部","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]],
      ["网宣部","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]],
      ["调研部","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]],
      ["学生会","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]],
      ["社团联合会","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]],
      ["青年志愿者协会（红十字会）","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]],
      ["《理工青年》工作室","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]],
      ["艺术团","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]],
      ["广播站","组织部是广东理工职业学院中山校区校团委的有机组成部分，具体负责我校共青团系统的组织建设工作：团建工作,发展新团员，党建“入党推优”工作，督促，协助各团总支组织开展团日活动等。组织部立足团员青年的切身利益，围绕学院和团内的中心，把握思想理论的制高点，发挥机动灵活的工作特点，发挥求真务实的工作作风，不断加强对广大团员青年的思想政治教育工作，巩固加强我校各系共青团各个支部建设。",["负责团系统组织建设，开展团日活动立项、评比、表彰；","负责团干部的教育、培训、考核等工作；","负责团员意识教育，做好日常团务工作及“推优”工作；","负责“五四”评优工作和团情统计工作；","负责协助党委组织部门开展党校工作；","负责实施“青年马克思主义者培训工程”；","完成领导交办的其他任务。"]]
    ]
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="scss" scoped>
.branch{
  width:1200px;
  margin:10px auto;
  .title{
    display:flex;
    align-items:center;
    padding:10px 0 0 0;
    border-bottom:2px solid #b60404;
    img{
      max-width:100%;
      height:auto;
      @media only screen and (max-width:400px){
        width:140px;
      }
    }
    h1{
      display:block;
      flex:1;
      padding:0 10px;
      height:100%;
      font-size:20px;
      font-weight:bold;
      color:#b60404;
      @media only screen and (max-width:500px){
        font-size:16px;
        letter-spacing:2px;
      }
    }
  }/*title*/
  .content{
    ul.option{
      margin:10px 0;
      li{
        float:left;
        padding:10px 15px;
        font-size:14px;
        letter-spacing:1px;
        cursor:pointer;
        &:hover{
          color:#b60404;
        }
        &.active{
          color:#fff;
          background:#b60404;
        }
      }
    }/*ul.option*/
    .text{
      margin-bottom:50px;
      h1{
        padding-top:20px;
        margin:0 0 10px 0;
        font-size:30px;
        text-align:center;
        clear:left;
      }
      p{
        &:nth-child(2n){
          margin:10px 0;
        }
        &:nth-child(2n-1){
          text-indent:32px;
          line-height:1.5;
        }
      }/*p*/
      ol{
        li{
          text-indent:32px;
          line-height:1.5;
        }
      }
    }
  }/*content*/
  @media only screen and (max-width:1200px){
    width:98%;
    padding:0 10px;
  }
}/*branch*/
</style>
